Revit 2027 API
RebarCoupler.IsUnobscuredInView Method
 Checks if this rebar coupler element is shown unobscured in a view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUnobscuredInView(
	View view
)
Public Function IsUnobscuredInView (
	view As View
) As Boolean
public:
bool IsUnobscuredInView(
	View^ view
)
member IsUnobscuredInView :
        view : View -> bool
Parameters
view View
 The view element
Return Value
Boolean
 True if rebar coupler is shown unobscured, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InapplicableDataException |  This rebar coupler element doesn't have valid visibility data
See Also
Reference
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace